/**
 * @brief Responsible for interacting with users
 * @version 1.0
 * @author CagurZhan
*/
#ifndef UI_CONTROLLER
#define UI_CONTROLLER
#include <iostream>
#include <string>
using namespace std;

class UIController{
public:
    void init();
    void menu();
};

void UIController::init(){
    cout <<
        "                          _ooOoo_                               " <<  endl <<   
        "                         o8888888o                              " << endl <<  
        "                         88\" . \"88                            " << endl <<  
        "                         (| ^_^ |)                              " << endl <<  
        "                         O\\  =  /O                             " << endl <<  
        "                      ____/`---'\\____                          " << endl <<  
        "                    .'  \\|     |//  `.                         " << endl <<  
        "                   /  \\|||  :  |||//  \\                       " << endl <<  
        "                  /  _||||| -:- |||||-  \\                      " << endl <<  
        "                  |   | \\\\\\  -  /// |   |                    " << endl <<  
        "                  | \\_|  ''\\---/''  |   |                     " << endl <<  
        "                  \\  .-\\__  `-`  ___/-. /                     " << endl <<  
        "                ___`. .'  /--.--\\  `. . ___                    " << endl <<  
        "              ."" '<  `.___\\_<|>_/___.'  >'"".                 " << endl <<  
        "            | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |               " << endl <<  
        "            \\  \\ `-.   \\_ __\\ /__ _/   .-` /  /             " << endl <<  
        "      ========`-.____`-.___\\_____/___.-`____.-'========        " << endl <<  
        "                           `=---='                              " << endl <<  
        "      ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^        " << endl <<  
        " >>>>>>>>>>(♥◠‿◠)ﾉﾞ 欢迎来到表达式求值系统  ლ(´ڡ`ლ)<<<<<<<<<<" << endl <<  
        " >>>>>>>>>>佛祖保佑ლ     永无BUGლ   永不修改ლ       <<<<<<<<<<"<< endl << 
        " >>>>>>>>>>输入1进入系统   输入2查看帮助  输入0退出系统<<<<<<<<<<"<< endl;
}

void UIController::menu(){
    cout <<
        " >>>>>>>>>>(♥◠‿◠)ﾉﾞ      系统菜单            ლ(´ڡ`ლ)<<<<<<<<<<" << endl <<  
        "      ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^    " << endl <<  
        " >>>>>>>>>>            输入1进入系统                <<<<<<<<<<"<< endl <<
        " >>>>>>>>>>            输入2查看帮助                <<<<<<<<<<"<< endl <<
        " >>>>>>>>>>            输入0退出系统                <<<<<<<<<<"<< endl;

}



#endif